# TOKEN: Токен от бота
TOKEN = '1835977552:AAHu-pGy0kDlVhHjCYekxj8XSTXfxdPNdGA'

# USER_AGENT: Для работы с веб-запросами
USER_AGENT = {'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) '
                            'Chrome/90.0.4430.212 Safari/537.36'}

# SITE_URL: Сайт с которого производится парсинг
SITE_URL = 'https://www.igromania.ru/'

# FOR_PAGINATION_URL: Каталог игр
FOR_PAGINATION_URL = 'https://www.igromania.ru/games/all/all/2020/all/all/0/'

# HELP: Сообщение о помощи
HELP = ' 🧙‍♂️ > Используй клавиатуру, чтобы пользоваться функционалом. '

MAINKEYBOARD = {
    'top-ten': '🏆 ТОП-10',
    'search': '🔎 ПОИСК',
}
GETGAMES = {
    'uncorrectName': 'Опаньки! Не получилось найти похожую игру, убедитесь что вводите правильно.',
    'alterGames': 'Ой-ой! Не получилось найти такую игру. Зато есть похожие!'
}

# PARSING: Управление парсингом. 0 = включить парсинг при включении
PARSING = 1
